import random

pairs = [
    (5000, 2500),  # 0.5000
    (5000, 2600),  # 0.4800
    (5000, 2400),  # 0.5200
    (5000, 2000),  # 0.6000
    (5000, 3000),  # 0.4000
    (5000, 2750),  # 0.4500
    (5000, 2250),  # 0.5500
    (4000, 2000),  # 0.5000
    (4000, 2200),  # 0.4500
    (4000, 1800),  # 0.5500
    (4000, 1600),  # 0.6000
    (4000, 2400),  # 0.4000
    (3000, 1500),  # 0.5000
    (3000, 1650),  # 0.4500
    (3000, 1350),  # 0.5500
    (3000, 1200),  # 0.6000
    (3000, 1800),  # 0.4000
    (2000, 1000),  # 0.5000
    (2000, 1100),  # 0.4500
    (2000, 900),   # 0.5500
    (2000, 800),   # 0.6000
    (2000, 1200),  # 0.4000
    (6000, 3000),  # 0.5000
    (6000, 3300),  # 0.4500
    (6000, 2700),  # 0.5500
    (6000, 2400),  # 0.6000
    (6000, 3600),  # 0.4000
    (10000, 5000), # 0.5000
    (10000, 5200), # 0.4800
    (10000, 4800), # 0.5200
    (10000, 4000), # 0.6000
    (10000, 6000), # 0.4000
    (10000, 5500), # 0.4500
    (10000, 4500), # 0.5500
    (10000, 7000), # 0.3000
    (10000, 3000), # 0.7000
    (10000, 8000), # 0.2000
    (10000, 2000), # 0.8000
    (8000, 4000),  # 0.5000
    (8000, 4400),  # 0.4500
    (8000, 3600),  # 0.5500
    (8000, 3200),  # 0.6000
    (8000, 4800),  # 0.4000
    (8000, 5600),  # 0.3000
    (8000, 2400),  # 0.7000
    (8000, 1600),  # 0.8000
]

total_babies, boys = random.choice(pairs)
girls = total_babies - boys
freq_girls = round(girls / total_babies, 4)

text = f"""
В некотором городе из {total_babies} появившихся на свет младенцев {boys} мальчиков.
Найдите частоту рождения девочек в этом городе. Результат округлите до десяти тысячных.
"""

text_of_solve = f"""
Общее число младенцев: {total_babies}
Число мальчиков: {boys}
Число девочек: {girls}

Частота рождения девочек = число девочек / общее число младенцев = {girls}/{total_babies} = {freq_girls}

Ответ: {freq_girls}
"""

print(text)
print(freq_girls)
print('__________________________')
print(text_of_solve)